kylebsmith/ESP32-S3-RLCD-cYbErDeCk/firmware/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Target and flash
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---------------------------------------------------------------------------
# THE ONE THAT RUINS SEQUENCERS
# docs/OS.md "Clock discipline": CONFIG_FREERTOS_HZ defaults to 100, so
# vTaskDelay(1) sleeps 10 ms. Set it now, not later.
# ---------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---------------------------------------------------------------------------
# PSRAM - octal, 8 MB. Documents and scrollback live here.
# The framebuffer does NOT: SPI DMA requires internal SRAM.
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---------------------------------------------------------------------------
# Console on the built-in USB-Serial/JTAG, so that flashing and monitoring
# need no buttons and no external adapter.
# ---------------------------------------------------------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---------------------------------------------------------------------------
# Bluetooth: NimBLE, central role (we are the HID *host*), no BR/EDR because
# the ESP32-S3 has no Classic radio at all.
# ---------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
# DUAL ROLE. The deck is a CENTRAL to the keyboard and simultaneously a
# PERIPHERAL for BLE MIDI - a laptop connects to the deck as a MIDI device.
# docs/OS.md never answered whether both roles can run at once on this part;
# MAX_CONNECTIONS is 2 for exactly this reason.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_MAX_BONDS=4
CONFIG_BT_NIMBLE_MAX_CCCDS=16
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# ---------------------------------------------------------------------------
# Main task needs room for the editor and the BLE callbacks.
# ---------------------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y

# ---------------------------------------------------------------------------
# The task watchdog panics rather than only complaining. A hang that prints a
# warning every few seconds and carries on is a hang nobody notices; the two
# silent failures this device has already had were both "something stopped and
# nothing acted on it".
# ---------------------------------------------------------------------------
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# The SD mirror names each file after its document; 8.3 would collide.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64

# USB MIDI as a CDC + MIDI composite. The console and the serial keyboard move
# to CDC; MIDI is the second interface. esp_tinyusb wraps CDC but not MIDI -
# TINYUSB_MIDI_COUNT > 0 simply sets CFG_TUD_MIDI and the tud_midi_* API is
# called directly, so no fork and no custom tusb_config.h.
#
# CONFIG_ESP_CONSOLE_USB_CDC is deliberately NOT set: it depends on !TINY_USB
# because it drives the ROM's own CDC driver, which is a different stack
# competing for the same controller.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_MIDI_COUNT=1

# A PANIC MUST REBOOT, NOT TRY TO EXPLAIN ITSELF FIRST.
#
# The default prints a backtrace and then reboots. In USB MIDI mode the console
# has been moved to a CDC interface that nothing may be draining, and in serial
# mode the USB-Serial-JTAG peripheral no longer owns the PHY - so the print can
# block forever and the reboot never happens. That is the difference between a
# device that recovers in two seconds and one that has to be power-cycled by
# hand, which is what kept happening.
#
# The reset reason is logged at the next boot instead, which is the part that
# was actually useful.
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y

# THE TWO-CORE SPLIT, ACTUALLY APPLIED.
#
# docs/OS.md argues that the clock and the display must not share a core, and
# then the firmware ran with ESP_TIMER_TASK_AFFINITY_CPU0 and
# ESP_MAIN_TASK_AFFINITY_CPU0 - the clock and the renderer on the same core of
# a dual-core chip, with the second core carrying only the MIDI transport task.
# The symptom was small and persistent: two ticks in six thousand past a
# millisecond, always while the visual preview was redrawing a pane where every
# cell changes. Making the renderer cheaper moved that number but could not
# remove it, because the contention was structural.
#
# So: CPU1 is the realtime half - the esp_timer task that IS the clock, at
# priority 22, alongside the MIDI transport task at 6, which seq.c already
# pinned there. CPU0 carries everything that can afford to wait: the editor,
# the panel, the keyboard, WiFi and BLE.
#
# This is the hinge the instrument rests on. A late tick is audible in a way a
# late frame is not, so when the two compete the frame loses - and now they do
# not compete at all.
# Only the chosen option is named: this is a kconfig CHOICE, and writing the
# other arm as =n resets the whole choice to its default, which is CPU0 - the
# exact thing being changed.
#
# CPU1 is gated behind SHOW_EXPERIMENTAL and IDF calls it experimental, so the
# caveat is worth stating rather than burying: what it changes is which core
# runs the timer TASK. The timer ISR stays on CPU0 and hands work across, which
# is an ordinary cross-core queue. What IDF is warning about is code that
# assumes a callback runs on CPU0 - this firmware has one esp_timer callback,
# the sequencer tick, and it touches only its own lane table and a queue the
# transport task on CPU1 already drains. Measured before and after on the deck,
# with the visuals running.
CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL=y
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU1=y
